server/modules/users/api/IndexController.php

SELECT COUNT(*) FROM `he_user` `user` LEFT JOIN `he_user_oauth` `oauth` ON `user`.`id` = `oauth`.`UID` WHERE (`user`.`AppID`='98c08c25f8136d590c') AND (`oauth`.`type`='weapp')
SELECT COUNT(*) FROM `he_user` `user` LEFT JOIN `he_user_oauth` `oauth` ON `user`.`id` = `oauth`.`UID` WHERE (`user`.`created_time` >= 1619366400) AND ((`user`.`AppID`='98c08c25f8136d590c') AND (`oauth`.`type`='weapp'))
---
    public function sourceStatistical($source = 'weapp')
    {
        $AppID     = Yii::$app->params['AppID'];
        $where     = [];
        $yesterday = strtotime('yesterday');
        $today     = strtotime(date("Y-m-d"));

        $user_number = M('users', 'User')::find()
            ->alias('user')
            ->joinWith([
                'oauth as oauth',
            ])
            ->where(['user.AppID' => $AppID, 'oauth.type' => $source])
            ->count(); //总人数

        $user_grow_neartwo = M('users', 'User')::find()
            ->alias('user')
            ->joinWith([
                'oauth as oauth',
            ])
            ->where(['and', ['>=', 'user.created_time', $yesterday], ['user.AppID' => $AppID, 'oauth.type' => $source]])
            ->count(); //近两天增长人数

        $user_grow_today = M('users', 'User')::find()
            ->alias('user')
            ->joinWith([
                'oauth as oauth',
            ])
            ->where(['and', ['>=', 'user.created_time', $today], ['user.AppID' => $AppID, 'oauth.type' => $source]])
            ->count(); //今天增长人数

SELECT `UID`, `pay_amount`, `pay_time` FROM `he_order` WHERE (`pay_time` > 1619280000) AND ((`AppID`='98c08c25f8136d590c') AND (`source`='weapp'))
---
        $user_number_yesteday = $user_number - $user_grow_today; //昨天总人数
        $user_grow_yesteday   = $user_grow_neartwo - $user_grow_today; //昨天增长人数

        $order_list_neartwo    = M('order', 'Order')::find()->where(['and', ['>', 'pay_time', $yesterday], ['AppID' => $AppID, 'source' => $source]])->select('UID,pay_amount,pay_time')->all(); //近两天付款订单列表